Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.h
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2018 Arm Limited (or its affiliates). All 
 * rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        19. February 2018
 * $Revision:    V2.8
 *
 * Project:      USART Driver definitions for ST STM32F4xx
 * -------------------------------------------------------------------------- */

#ifndef __USART_STM32F4XX_H
#define __USART_STM32F4XX_H

#include <stdint.h>
#include <stdbool.h>
#include <string.h>

#include "Driver_USART.h"
#include "stm32f4xx_hal.h"

#include "RTE_Components.h"
#if   defined(RTE_DEVICE_FRAMEWORK_CLASSIC)
#include "RTE_Device.h"
#elif defined(RTE_DEVICE_FRAMEWORK_CUBE_MX)
  #define  VM_ASYNC                      (1UL)
  #define  VM_SYNC                       (2UL)
  #define  VM_IRDA                       (3UL)
  #define  VM_SMARTCARD                  (4UL)
  #define  Asynchronous                  VM_ASYNC
  #define  IrDA                          VM_IRDA
#include "MX_Device.h"
#else
#error "::Device:STM32Cube Framework: not selected in RTE"
#endif

#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  #if ((defined(RTE_Drivers_USART1) || \
        defined(RTE_Drivers_USART2) || \
        defined(RTE_Drivers_USART3) || \
        defined(RTE_Drivers_UART4 ) || \
        defined(RTE_Drivers_UART5 ) || \
        defined(RTE_Drivers_USART6) || \
        defined(RTE_Drivers_UART7 ) || \
        defined(RTE_Drivers_UART8 ) || \
        defined(RTE_Drivers_UART9 ) || \
        defined(RTE_Drivers_UART10))   \
       && (RTE_USART1 == 0)            \
       && (RTE_USART2 == 0)            \
       && (RTE_USART3 == 0)            \
       && (RTE_UART4  == 0)            \
       && (RTE_UART5  == 0)            \
       && (RTE_USART6 == 0)            \
       && (RTE_UART7  == 0)            \
       && (RTE_UART8  == 0)            \
       && (RTE_UART9  == 0)            \
       && (RTE_UART10 == 0))
    #error "USART not configured in RTE_Device.h!"
  #endif

// RTE macros
#define _DMA_CHANNEL_x(x)               DMA_CHANNEL_##x
#define  DMA_CHANNEL_x(x)              _DMA_CHANNEL_x(x)

#define  DMA_PRIORITY(x)              ((x == 0) ? DMA_PRIORITY_LOW    : \
                                       (x == 1) ? DMA_PRIORITY_MEDIUM : \
                                       (x == 2) ? DMA_PRIORITY_HIGH   : \
                                                  DMA_PRIORITY_VERY_HIGH)

#define _DMAx_STREAMy(x, y)             DMA##x##_Stream##y
#define  DMAx_STREAMy(x, y)            _DMAx_STREAMy(x, y)

#define _DMAx_STREAMy_IRQ(x, y)         DMA##x##_Stream##y##_IRQHandler
#define  DMAx_STREAMy_IRQ(x, y)        _DMAx_STREAMy_IRQ(x, y)

#define _DMAx_STREAMy_IRQn(x, y)        DMA##x##_Stream##y##_IRQn
#define  DMAx_STREAMy_IRQn(x, y)       _DMAx_STREAMy_IRQn(x, y)

// USART1 configuration definitions
#if (RTE_USART1 == 1)
  #define MX_USART1

  #if (RTE_USART1_RX_DMA == 1)
    #define MX_USART1_RX_DMA_Instance DMAx_STREAMy(RTE_USART1_RX_DMA_NUMBER, RTE_USART1_RX_DMA_STREAM)
    #define MX_USART1_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_USART1_RX_DMA_NUMBER, RTE_USART1_RX_DMA_STREAM)
    #define MX_USART1_RX_DMA_Channel  DMA_CHANNEL_x(RTE_USART1_RX_DMA_CHANNEL)
    #define MX_USART1_RX_DMA_Priority DMA_PRIORITY(RTE_USART1_RX_DMA_PRIORITY)

    #define USART1_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_USART1_RX_DMA_NUMBER, RTE_USART1_RX_DMA_STREAM)
  #endif
  #if (RTE_USART1_TX_DMA == 1)
    #define MX_USART1_TX_DMA_Instance DMAx_STREAMy(RTE_USART1_TX_DMA_NUMBER, RTE_USART1_TX_DMA_STREAM)
    #define MX_USART1_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_USART1_TX_DMA_NUMBER, RTE_USART1_TX_DMA_STREAM)
    #define MX_USART1_TX_DMA_Channel  DMA_CHANNEL_x(RTE_USART1_TX_DMA_CHANNEL)
    #define MX_USART1_TX_DMA_Priority DMA_PRIORITY(RTE_USART1_TX_DMA_PRIORITY)

    #define USART1_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_USART1_TX_DMA_NUMBER, RTE_USART1_TX_DMA_STREAM)
  #endif

  #ifndef USART1_GPIO_SPEED_FREQ
    #define USART1_GPIO_SPEED_FREQ    GPIO_SPEED_FREQ_LOW
  #endif

  #if (RTE_USART1_TX == 1)
    #if defined (STM32F410Tx)
      // USART1 TX available on pins: PA15, PB6
      #if ((RTE_USART1_TX_ID != 2) && (RTE_USART1_TX_ID != 3))
        #error "Only PA15 and PB6 can be configured as USART TX on selected device!"
      #endif
    #elif !defined (STM32F411xE)
      // PA15 as USART1 TX only available on STM32F411xx
      #if (RTE_USART1_TX_ID == 2)
        #error "PA15 can not be configured as USART1 TX on selected device!"
      #endif
    #endif

    #define MX_USART1_TX_Pin        1
    #define MX_USART1_TX_GPIOx      RTE_USART1_TX_PORT
    #define MX_USART1_TX_GPIO_Pin   (1U << RTE_USART1_TX_BIT)
    #define MX_USART1_TX_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART1_TX_GPIO_Speed USART1_GPIO_SPEED_FREQ
    #define MX_USART1_TX_GPIO_AF    GPIO_AF7_USART1
  #endif

  #if (RTE_USART1_RX == 1)
    #if defined (STM32F410Tx)
      // USART1 RX available on pins: PB3, PB7
      #if ((RTE_USART1_RX_ID != 2) && (RTE_USART1_RX_ID != 3))
        #error "Only PB3 and PB7 can be configured as USART1 RX on selected device!"
      #endif
    #elif !defined (STM32F411xE)
      // PB3 as USART1 RX only available on STM32F411xx
      #if (RTE_USART1_RX_ID == 2)
        #error "PB3 can not be configured as USART1 RX on selected device!"
      #endif
    #endif

    #define MX_USART1_RX_Pin        1
    #define MX_USART1_RX_GPIOx      RTE_USART1_RX_PORT
    #define MX_USART1_RX_GPIO_Pin   (1U << RTE_USART1_RX_BIT)
    #define MX_USART1_RX_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART1_RX_GPIO_Speed USART1_GPIO_SPEED_FREQ
    #define MX_USART1_RX_GPIO_AF    GPIO_AF7_USART1
  #endif

  #if (RTE_USART1_CK == 1)
    #define MX_USART1_CK_Pin        1
    #define MX_USART1_CK_GPIOx      RTE_USART1_CK_PORT
    #define MX_USART1_CK_GPIO_Pin   (1U << RTE_USART1_CK_BIT)
    #define MX_USART1_CK_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART1_CK_GPIO_Speed USART1_GPIO_SPEED_FREQ
    #define MX_USART1_CK_GPIO_AF    GPIO_AF7_USART1
  #endif


  #if (RTE_USART1_RTS == 1)
    #if defined (STM32F410Tx)
      // USART1 CTS pin is not available
      #error "USART1 CTS pin is not available on selected device!"
    #endif

    #define MX_USART1_RTS_Pin        1
    #define MX_USART1_RTS_GPIOx      RTE_USART1_RTS_PORT
    #define MX_USART1_RTS_GPIO_Pin   (1U << RTE_USART1_RTS_BIT)
    #define MX_USART1_RTS_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART1_RTS_GPIO_Speed USART1_GPIO_SPEED_FREQ
    #define MX_USART1_RTS_GPIO_AF    GPIO_AF7_USART1
  #endif

