Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.h
  #if (RTE_USART1_CTS == 1)
    #define MX_USART1_CTS_Pin        1
    #define MX_USART1_CTS_GPIOx      RTE_USART1_CTS_PORT
    #define MX_USART1_CTS_GPIO_Pin   (1U << RTE_USART1_CTS_BIT)
    #define MX_USART1_CTS_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART1_CTS_GPIO_Speed USART1_GPIO_SPEED_FREQ
    #define MX_USART1_CTS_GPIO_AF    GPIO_AF7_USART1
  #endif
#endif

// USART2 configuration definitions
#if (RTE_USART2 == 1)
  #define MX_USART2

  #if (RTE_USART2_RX_DMA == 1)
    #define MX_USART2_RX_DMA_Instance DMAx_STREAMy(RTE_USART2_RX_DMA_NUMBER, RTE_USART2_RX_DMA_STREAM)
    #define MX_USART2_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_USART2_RX_DMA_NUMBER, RTE_USART2_RX_DMA_STREAM)
    #define MX_USART2_RX_DMA_Channel  DMA_CHANNEL_x(RTE_USART2_RX_DMA_CHANNEL)
    #define MX_USART2_RX_DMA_Priority DMA_PRIORITY(RTE_USART2_RX_DMA_PRIORITY)

    #define USART2_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_USART2_RX_DMA_NUMBER, RTE_USART2_RX_DMA_STREAM)
  #endif
  #if (RTE_USART2_TX_DMA == 1)
    #define MX_USART2_TX_DMA_Instance DMAx_STREAMy(RTE_USART2_TX_DMA_NUMBER, RTE_USART2_TX_DMA_STREAM)
    #define MX_USART2_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_USART2_TX_DMA_NUMBER, RTE_USART2_TX_DMA_STREAM)
    #define MX_USART2_TX_DMA_Channel  DMA_CHANNEL_x(RTE_USART2_TX_DMA_CHANNEL)
    #define MX_USART2_TX_DMA_Priority DMA_PRIORITY(RTE_USART2_TX_DMA_PRIORITY)

    #define USART2_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_USART2_TX_DMA_NUMBER, RTE_USART2_TX_DMA_STREAM)
  #endif

  #ifndef USART2_GPIO_SPEED_FREQ
    #define USART2_GPIO_SPEED_FREQ    GPIO_SPEED_FREQ_LOW
  #endif

  #if (RTE_USART2_TX == 1)
    #if defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx)
      // USART2 TX available on pin: PA2
      #if (RTE_USART2_TX_ID != 1)
        #error "Only PA2 can be configured as USART2 TX on selected device!"
      #endif
    #endif

    #define MX_USART2_TX_Pin        1
    #define MX_USART2_TX_GPIOx      RTE_USART2_TX_PORT
    #define MX_USART2_TX_GPIO_Pin   (1U << RTE_USART2_TX_BIT)
    #define MX_USART2_TX_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART2_TX_GPIO_Speed USART2_GPIO_SPEED_FREQ
    #define MX_USART2_TX_GPIO_AF    GPIO_AF7_USART2
  #endif

  #if (RTE_USART2_RX == 1)
    #if defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx)
      // USART2 RX available on pin: PA3
      #if (RTE_USART2_RX_ID != 1)
        #error "Only PA3 can be configured as USART2 RX on selected device!"
      #endif
    #endif

    #define MX_USART2_RX_Pin        1
    #define MX_USART2_RX_GPIOx      RTE_USART2_RX_PORT
    #define MX_USART2_RX_GPIO_Pin   (1U << RTE_USART2_RX_BIT)
    #define MX_USART2_RX_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART2_RX_GPIO_Speed USART2_GPIO_SPEED_FREQ
    #define MX_USART2_RX_GPIO_AF    GPIO_AF7_USART2
  #endif

  #if (RTE_USART2_CK == 1)
    #if defined(STM32F410Tx)
      // USART2 CK is not available
      #error "USART2 CK pin is not available on selected device!"
    #elif defined(STM32F410Cx) || defined(STM32F410Rx)
      // USART2 CK available on pin: PA4
      #if ((RTE_USART2_CK_ID != 0) && (RTE_USART2_CK_ID != 1))
        #error "Only PA4 can be configured as USART2 CK on selected device!"
      #endif
    #endif

    #define MX_USART2_CK_Pin        1
    #define MX_USART2_CK_GPIOx      RTE_USART2_CK_PORT
    #define MX_USART2_CK_GPIO_Pin   (1U << RTE_USART2_CK_BIT)
    #define MX_USART2_CK_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART2_CK_GPIO_Speed USART2_GPIO_SPEED_FREQ
    #define MX_USART2_CK_GPIO_AF    GPIO_AF7_USART2
  #endif


  #if (RTE_USART2_RTS == 1)
    #if defined(STM32F410Tx) || defined(STM32F410Cx) || defined(STM32F410Rx)
      // USART2 CTS available on pin: PA0
      #if ((RTE_USART2_CTS_ID != 0) && (RTE_USART2_CTS_ID != 1))
        #error "Only PA0 can be configured as USART2 CTS on selected device!"
      #endif
    #endif

    #define MX_USART2_RTS_Pin        1
    #define MX_USART2_RTS_GPIOx      RTE_USART2_RTS_PORT
    #define MX_USART2_RTS_GPIO_Pin   (1U << RTE_USART2_RTS_BIT)
    #define MX_USART2_RTS_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART2_RTS_GPIO_Speed USART2_GPIO_SPEED_FREQ
    #define MX_USART2_RTS_GPIO_AF    GPIO_AF7_USART2
  #endif

  #if (RTE_USART2_CTS == 1)
    #if defined(STM32F410Tx)
      // USART2 RTS is not available
      #error "USART2 RTS pin is not available on selected device!"
    #elif defined(STM32F410Cx) || defined(STM32F410Rx)
      // USART2 RTS available on pin: PA1
      #if ((RTE_USART2_RTS_ID != 0) && (RTE_USART2_RTS_ID != 1))
        #error "Only PA1 can be configured as USART2 RTS on selected device!"
      #endif
    #endif

    #define MX_USART2_CTS_Pin        1
    #define MX_USART2_CTS_GPIOx      RTE_USART2_CTS_PORT
    #define MX_USART2_CTS_GPIO_Pin   (1U << RTE_USART2_CTS_BIT)
    #define MX_USART2_CTS_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART2_CTS_GPIO_Speed USART2_GPIO_SPEED_FREQ
    #define MX_USART2_CTS_GPIO_AF    GPIO_AF7_USART2
  #endif
#endif

// USART3 configuration definitions
#if (RTE_USART3 == 1)

  #ifndef USART3
    #error "USART3 not available for selected device!"
  #endif

  #define MX_USART3

  #if (RTE_USART3_RX_DMA == 1)
    #define MX_USART3_RX_DMA_Instance DMAx_STREAMy(RTE_USART3_RX_DMA_NUMBER, RTE_USART3_RX_DMA_STREAM)
    #define MX_USART3_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_USART3_RX_DMA_NUMBER, RTE_USART3_RX_DMA_STREAM)
    #define MX_USART3_RX_DMA_Channel  DMA_CHANNEL_x(RTE_USART3_RX_DMA_CHANNEL)
    #define MX_USART3_RX_DMA_Priority DMA_PRIORITY(RTE_USART3_RX_DMA_PRIORITY)

    #define USART3_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_USART3_RX_DMA_NUMBER, RTE_USART3_RX_DMA_STREAM)
  #endif
  #if (RTE_USART3_TX_DMA == 1)
    #define MX_USART3_TX_DMA_Instance DMAx_STREAMy(RTE_USART3_TX_DMA_NUMBER, RTE_USART3_TX_DMA_STREAM)
    #define MX_USART3_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_USART3_TX_DMA_NUMBER, RTE_USART3_TX_DMA_STREAM)
    #define MX_USART3_TX_DMA_Channel  DMA_CHANNEL_x(RTE_USART3_TX_DMA_CHANNEL)
    #define MX_USART3_TX_DMA_Priority DMA_PRIORITY(RTE_USART3_TX_DMA_PRIORITY)

    #define USART3_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_USART3_TX_DMA_NUMBER, RTE_USART3_TX_DMA_STREAM)
  #endif

  #ifndef USART3_GPIO_SPEED_FREQ
    #define USART3_GPIO_SPEED_FREQ    GPIO_SPEED_FREQ_LOW
  #endif

  #if (RTE_USART3_TX == 1)
    #define MX_USART3_TX_Pin        1
    #define MX_USART3_TX_GPIOx      RTE_USART3_TX_PORT
    #define MX_USART3_TX_GPIO_Pin   (1U << RTE_USART3_TX_BIT)
    #define MX_USART3_TX_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART3_TX_GPIO_Speed USART3_GPIO_SPEED_FREQ
    #define MX_USART3_TX_GPIO_AF    GPIO_AF7_USART3
  #endif

  #if (RTE_USART3_RX == 1)
    #define MX_USART3_RX_Pin        1
    #define MX_USART3_RX_GPIOx      RTE_USART3_RX_PORT
    #define MX_USART3_RX_GPIO_Pin   (1U << RTE_USART3_RX_BIT)
    #define MX_USART3_RX_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART3_RX_GPIO_Speed USART3_GPIO_SPEED_FREQ
    #define MX_USART3_RX_GPIO_AF    GPIO_AF7_USART3
  #endif

