Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.h
  #if (RTE_USART3_CK == 1)
    #define MX_USART3_CK_Pin        1
    #define MX_USART3_CK_GPIOx      RTE_USART3_CK_PORT
    #define MX_USART3_CK_GPIO_Pin   (1U << RTE_USART3_CK_BIT)
    #define MX_USART3_CK_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART3_CK_GPIO_Speed USART3_GPIO_SPEED_FREQ
#if (RTE_USART3_CK_ID == 1) && \
    (defined (STM32F413xx) || defined (STM32F423xx) || \
     defined(STM32F412Zx ) || defined(STM32F412Vx ) || defined(STM32F412Rx) || defined(STM32F412Cx))
    #define MX_USART3_CK_GPIO_AF    GPIO_AF8_USART3
#else
    #define MX_USART3_CK_GPIO_AF    GPIO_AF7_USART3
#endif
  #endif


  #if (RTE_USART3_RTS == 1)
    #define MX_USART3_RTS_Pin        1
    #define MX_USART3_RTS_GPIOx      RTE_USART3_RTS_PORT
    #define MX_USART3_RTS_GPIO_Pin   (1U << RTE_USART3_RTS_BIT)
    #define MX_USART3_RTS_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART3_RTS_GPIO_Speed USART3_GPIO_SPEED_FREQ
    #define MX_USART3_RTS_GPIO_AF    GPIO_AF7_USART3
  #endif

  #if (RTE_USART3_CTS == 1)
    #define MX_USART3_CTS_Pin        1
    #define MX_USART3_CTS_GPIOx      RTE_USART3_CTS_PORT
    #define MX_USART3_CTS_GPIO_Pin   (1U << RTE_USART3_CTS_BIT)
    #define MX_USART3_CTS_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART3_CTS_GPIO_Speed USART3_GPIO_SPEED_FREQ
#if (RTE_USART3_CK_ID == 1) && \
    (defined (STM32F413xx) || defined (STM32F423xx) || \
     defined(STM32F412Zx ) || defined(STM32F412Vx ) || defined(STM32F412Rx) || defined(STM32F412Cx))
    #define MX_USART3_CTS_GPIO_AF    GPIO_AF8_USART3
#else
    #define MX_USART3_CTS_GPIO_AF    GPIO_AF7_USART3
#endif
  #endif
#endif

// UART4 configuration definitions
#if (RTE_UART4 == 1)

  #ifndef UART4
    #error "UART4 not available for selected device!"
  #endif

  #define MX_UART4

  #if (RTE_UART4_RX_DMA == 1)
    #define MX_UART4_RX_DMA_Instance DMAx_STREAMy(RTE_UART4_RX_DMA_NUMBER, RTE_UART4_RX_DMA_STREAM)
    #define MX_UART4_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_UART4_RX_DMA_NUMBER, RTE_UART4_RX_DMA_STREAM)
    #define MX_UART4_RX_DMA_Channel  DMA_CHANNEL_x(RTE_UART4_RX_DMA_CHANNEL)
    #define MX_UART4_RX_DMA_Priority DMA_PRIORITY(RTE_UART4_RX_DMA_PRIORITY)

    #define UART4_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_UART4_RX_DMA_NUMBER, RTE_UART4_RX_DMA_STREAM)
  #endif
  #if (RTE_UART4_TX_DMA == 1)
    #define MX_UART4_TX_DMA_Instance DMAx_STREAMy(RTE_UART4_TX_DMA_NUMBER, RTE_UART4_TX_DMA_STREAM)
    #define MX_UART4_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_UART4_TX_DMA_NUMBER, RTE_UART4_TX_DMA_STREAM)
    #define MX_UART4_TX_DMA_Channel  DMA_CHANNEL_x(RTE_UART4_TX_DMA_CHANNEL)
    #define MX_UART4_TX_DMA_Priority DMA_PRIORITY(RTE_UART4_TX_DMA_PRIORITY)

    #define UART4_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_UART4_TX_DMA_NUMBER, RTE_UART4_TX_DMA_STREAM)
  #endif

  #ifndef UART4_GPIO_SPEED_FREQ
    #define UART4_GPIO_SPEED_FREQ    GPIO_SPEED_FREQ_LOW
  #endif

  #if (RTE_UART4_TX == 1)
    #if defined (STM32F413xx) || defined (STM32F423xx)
      // UART4 TX available on pins: PA0, PD10, PA12, PD1
      #if ((RTE_UART4_TX_ID == 2))
        #error "PC10 can not be configured as UART4 TX on selected device!"
      #endif
    #else
      // UART4 TX available on pins: PA0, PC10
      #if ((RTE_UART4_TX_ID != 1) && (RTE_UART4_TX_ID != 2))
        #error "PD10, PA12, PD1 can not be configured as UART4 TX on selected device!"
      #endif
    #endif

    #define MX_UART4_TX_Pin        1
    #define MX_UART4_TX_GPIOx      RTE_UART4_TX_PORT
    #define MX_UART4_TX_GPIO_Pin   (1U << RTE_UART4_TX_BIT)
    #define MX_UART4_TX_GPIO_PuPd  GPIO_NOPULL
    #define MX_UART4_TX_GPIO_Speed UART4_GPIO_SPEED_FREQ
#if ((RTE_UART4_TX_ID == 4) || (RTE_UART4_TX_ID == 5)) && \
    (defined (STM32F413xx) || defined (STM32F423xx))
    #define MX_UART4_TX_GPIO_AF   GPIO_AF11_UART4
#else
    #define MX_UART4_TX_GPIO_AF   GPIO_AF8_UART4
#endif
  #endif

  #if (RTE_UART4_RX == 1)
    #if !defined (STM32F413xx) && !defined (STM32F423xx)
      // UART4 RX available on pins: PA1, PC11
      #if ((RTE_UART4_TX_ID != 1) && (RTE_UART4_TX_ID != 2))
        #error "PA11, PD0 can not be configured as UART4 RX on selected device!"
      #endif
    #endif

    #define MX_UART4_RX_Pin        1
    #define MX_UART4_RX_GPIOx      RTE_UART4_RX_PORT
    #define MX_UART4_RX_GPIO_Pin   (1U << RTE_UART4_RX_BIT)
    #define MX_UART4_RX_GPIO_PuPd  GPIO_NOPULL
    #define MX_UART4_RX_GPIO_Speed UART4_GPIO_SPEED_FREQ
#if ((RTE_UART4_RX_ID == 3) || (RTE_UART4_RX_ID == 4)) && \
    (defined (STM32F413xx) || defined (STM32F423xx))
    #define MX_UART4_RX_GPIO_AF    GPIO_AF11_UART4
#else
    #define MX_UART4_RX_GPIO_AF    GPIO_AF8_UART4
#endif
  #endif
#endif

// UART5 configuration definitions
#if (RTE_UART5 == 1)

  #ifndef UART5
    #error "UART5 not available for selected device!"
  #endif

  #define MX_UART5

  #if (RTE_UART5_RX_DMA == 1)
    #define MX_UART5_RX_DMA_Instance DMAx_STREAMy(RTE_UART5_RX_DMA_NUMBER, RTE_UART5_RX_DMA_STREAM)
    #define MX_UART5_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_UART5_RX_DMA_NUMBER, RTE_UART5_RX_DMA_STREAM)
    #define MX_UART5_RX_DMA_Channel  DMA_CHANNEL_x(RTE_UART5_RX_DMA_CHANNEL)
    #define MX_UART5_RX_DMA_Priority DMA_PRIORITY(RTE_UART5_RX_DMA_PRIORITY)

    #define UART5_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_UART5_RX_DMA_NUMBER, RTE_UART5_RX_DMA_STREAM)
  #endif
  #if (RTE_UART5_TX_DMA == 1)
    #define MX_UART5_TX_DMA_Instance DMAx_STREAMy(RTE_UART5_TX_DMA_NUMBER, RTE_UART5_TX_DMA_STREAM)
    #define MX_UART5_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_UART5_TX_DMA_NUMBER, RTE_UART5_TX_DMA_STREAM)
    #define MX_UART5_TX_DMA_Channel  DMA_CHANNEL_x(RTE_UART5_TX_DMA_CHANNEL)
    #define MX_UART5_TX_DMA_Priority DMA_PRIORITY(RTE_UART5_TX_DMA_PRIORITY)

    #define UART5_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_UART5_TX_DMA_NUMBER, RTE_UART5_TX_DMA_STREAM)
  #endif

  #ifndef UART5_GPIO_SPEED_FREQ
    #define UART5_GPIO_SPEED_FREQ    GPIO_SPEED_FREQ_LOW
  #endif

  #if (RTE_UART5_TX == 1)
    #if !defined (STM32F413xx) && !defined (STM32F423xx)
      // UART5 TX available on pins: PC12
      #if ((RTE_UART5_TX_ID != 1))
        #error "PB6, PB9, PB13 can not be configured as UART5 TX on selected device!"
      #endif
    #endif

    #define MX_UART5_TX_Pin        1
    #define MX_UART5_TX_GPIOx      RTE_UART5_TX_PORT
    #define MX_UART5_TX_GPIO_Pin   (1U << RTE_UART5_TX_BIT)
    #define MX_UART5_TX_GPIO_PuPd  GPIO_NOPULL
    #define MX_UART5_TX_GPIO_Speed UART5_GPIO_SPEED_FREQ
#if ((RTE_UART5_TX_ID == 2) || (RTE_UART5_TX_ID == 3) || (RTE_UART5_TX_ID == 4)) && \
    (defined (STM32F413xx) || defined (STM32F423xx))
    #define MX_UART5_TX_GPIO_AF    GPIO_AF11_UART5
#else
    #define MX_UART5_TX_GPIO_AF    GPIO_AF8_UART5
#endif
  #endif

  #if (RTE_UART5_RX == 1)
    #if !defined (STM32F413xx) && !defined (STM32F423xx)
      // UART5 RX available on pins: PD2
      #if ((RTE_UART5_RX_ID != 1))
        #error "PB5, PB8, PB12 can not be configured as UART5 RX on selected device!"
      #endif
    #endif

    #define MX_UART5_RX_Pin        1
    #define MX_UART5_RX_GPIOx      RTE_UART5_RX_PORT
    #define MX_UART5_RX_GPIO_Pin   (1U << RTE_UART5_RX_BIT)
    #define MX_UART5_RX_GPIO_PuPd  GPIO_NOPULL
    #define MX_UART5_RX_GPIO_Speed UART5_GPIO_SPEED_FREQ
#if ((RTE_UART5_RX_ID == 2) || (RTE_UART5_RX_ID == 3) || (RTE_UART5_RX_ID == 4)) && \
    (defined (STM32F413xx) || defined (STM32F423xx))
    #define MX_UART5_RX_GPIO_AF    GPIO_AF11_UART5
#else
    #define MX_UART5_RX_GPIO_AF    GPIO_AF8_UART5
#endif
  #endif
#endif

// USART6 configuration definitions
#if defined (STM32F410Tx) && defined (USART6)
  // USART6 not available on WLCSP36 package
  #undef USART6
#endif

