Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.h
#if (RTE_USART6 == 1)
  #define MX_USART6

  #ifndef USART6
    #error "USART6 not available for selected device!"
  #endif

  #if (RTE_USART6_RX_DMA == 1)
    #define MX_USART6_RX_DMA_Instance DMAx_STREAMy(RTE_USART6_RX_DMA_NUMBER, RTE_USART6_RX_DMA_STREAM)
    #define MX_USART6_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_USART6_RX_DMA_NUMBER, RTE_USART6_RX_DMA_STREAM)
    #define MX_USART6_RX_DMA_Channel  DMA_CHANNEL_x(RTE_USART6_RX_DMA_CHANNEL)
    #define MX_USART6_RX_DMA_Priority DMA_PRIORITY(RTE_USART6_RX_DMA_PRIORITY)

    #define USART6_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_USART6_RX_DMA_NUMBER, RTE_USART6_RX_DMA_STREAM)
  #endif
  #if (RTE_USART6_TX_DMA == 1)
    #define MX_USART6_TX_DMA_Instance DMAx_STREAMy(RTE_USART6_TX_DMA_NUMBER, RTE_USART6_TX_DMA_STREAM)
    #define MX_USART6_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_USART6_TX_DMA_NUMBER, RTE_USART6_TX_DMA_STREAM)
    #define MX_USART6_TX_DMA_Channel  DMA_CHANNEL_x(RTE_USART6_TX_DMA_CHANNEL)
    #define MX_USART6_TX_DMA_Priority DMA_PRIORITY(RTE_USART6_TX_DMA_PRIORITY)

    #define USART6_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_USART6_TX_DMA_NUMBER, RTE_USART6_TX_DMA_STREAM)
  #endif

  #ifndef USART6_GPIO_SPEED_FREQ
    #define USART6_GPIO_SPEED_FREQ    GPIO_SPEED_FREQ_LOW
  #endif

  #if (RTE_USART6_TX == 1)
    #if defined (STM32F410Cx) || defined (STM32F412Cx)
      // USART6 TX available on pin: PA11
      #if ((RTE_USART6_TX_ID != 1)
        #error "Only PA11 can be configured as USART6 TX on selected device!"
      #endif
    #elif defined (STM32F410Rx) || defined (STM32F412Rx) || defined (STM32F412Vx)
      // USART6 TX available on pins: PA11, PC6
      #if ((RTE_USART6_TX_ID != 1) && (RTE_USART6_TX_ID != 2))
        #error "Only PA11 and PC6 can be configured as USART6 TX on selected device!"
      #endif
    #elif defined (STM32F401xC) || defined (STM32F401xE) || defined (STM32F411xE)
      // PG14 as USART6 TX not available on STM32F401xx and STM32F411xx
      #if (RTE_USART6_TX_ID == 3)
        #error "PG14 can not be configured as USART6 TX on selected device!"
      #endif
    #elif defined (STM32F412Zx) || defined (STM32F413xx) || defined (STM32F423xx)
      // USART6 TX available on pins: PA11, PC6, PG14
    #else
      // PA11 as USART6 TX only available on STM32F401xx and STM32F411xx
      #if (RTE_USART6_TX_ID == 1)
        #error "PA11 can not be configured as USART6 TX on selected device!"
      #endif
    #endif

    #define MX_USART6_TX_Pin        1
    #define MX_USART6_TX_GPIOx      RTE_USART6_TX_PORT
    #define MX_USART6_TX_GPIO_Pin   (1U << RTE_USART6_TX_BIT)
    #define MX_USART6_TX_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART6_TX_GPIO_Speed USART6_GPIO_SPEED_FREQ
    #define MX_USART6_TX_GPIO_AF    GPIO_AF8_USART6
  #endif

  #if (RTE_USART6_RX == 1)
    #if defined (STM32F410Cx) || defined (STM32F412Cx)
      // USART6 RX available on pin: PA12
      #if ((RTE_USART6_RX_ID != 1)
        #error "Only PA12 can be configured as USART6 RX on selected device!"
      #endif
    #elif defined (STM32F410Rx) || defined (STM32F412Rx) || defined (STM32F412Vx)
      // USART6 RX available on pins: PA12, PC7
      #if ((RTE_USART6_RX_ID != 1) && (RTE_USART6_RX_ID != 2))
        #error "Only PA12 and PC7 can be configured as USART6 RX on selected device!"
      #endif
    #elif defined (STM32F401xC) || defined (STM32F401xE) || defined (STM32F411xE)
      // PG9 as USART6 RX not available on STM32F401xx and STM32F411xx
      #if (RTE_USART6_RX_ID == 3)
        #error "PG9 can not be configured as USART6 RX on selected device!"
      #endif
    #elif defined (STM32F412Zx) || defined (STM32F413xx) || defined (STM32F423xx)
      // USART6 RX available on pins: PA12, PC7, PG9
    #else
      // PA12 as USART6 RX only available on STM32F401xx and STM32F411xx
      #if (RTE_USART6_RX_ID == 1)
        #error "PA12 can not be configured as USART6 RX on selected device!"
      #endif
    #endif

    #define MX_USART6_RX_Pin        1
    #define MX_USART6_RX_GPIOx      RTE_USART6_RX_PORT
    #define MX_USART6_RX_GPIO_Pin   (1U << RTE_USART6_RX_BIT)
    #define MX_USART6_RX_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART6_RX_GPIO_Speed USART6_GPIO_SPEED_FREQ
    #define MX_USART6_RX_GPIO_AF    GPIO_AF8_USART6
  #endif

  #if (RTE_USART6_CK == 1)
    #if defined (STM32F410Cx)
      // USART6 CK pin is not available
      #error "USART2 CK pin is not available on selected device!"
    #elif defined (STM32F410Rx)
      // USART6 CK available on pin: PC8
      #if ((RTE_USART6_CK_ID != 0) && (RTE_USART6_CK_ID != 1)
        #error "Only PC8 can be configured as USART6 CK on selected device!"
      #endif
    #elif defined (STM32F401xC) || defined (STM32F401xE) || defined (STM32F411xE)
      // PG7 as USART6 CK not available on STM32F401xx and STM32F411xx
      #if (RTE_USART6_CK_ID == 2)
        #error "PG7 can not be configured as USART6 CK on selected device!"
      #endif
    #endif

    #define MX_USART6_CK_Pin        1
    #define MX_USART6_CK_GPIOx      RTE_USART6_CK_PORT
    #define MX_USART6_CK_GPIO_Pin   (1U << RTE_USART6_CK_BIT)
    #define MX_USART6_CK_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART6_CK_GPIO_Speed USART6_GPIO_SPEED_FREQ
    #define MX_USART6_CK_GPIO_AF    GPIO_AF8_USART6
  #endif

  #if (RTE_USART6_RTS == 1)
    #if defined (STM32F401xC) || defined (STM32F401xE) || defined (STM32F411xE) || \
        defined (STM32F410Cx) || defined (STM32F410Rx)
      #error "CTS line not available on selected device!"
    #endif
    #define MX_USART6_RTS_Pin        1
    #define MX_USART6_RTS_GPIOx      RTE_USART6_RTS_PORT
    #define MX_USART6_RTS_GPIO_Pin   (1U << RTE_USART6_RTS_BIT)
    #define MX_USART6_RTS_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART6_RTS_GPIO_Speed USART6_GPIO_SPEED_FREQ
    #define MX_USART6_RTS_GPIO_AF    GPIO_AF8_USART6
  #endif

  #if (RTE_USART6_CTS == 1)
    #if defined (STM32F401xC) || defined (STM32F401xE) || defined (STM32F411xE) || \
        defined (STM32F410Cx) || defined (STM32F410Rx)
      #error "RTS line not available on selected device!"
    #endif
    #define MX_USART6_CTS_Pin        1
    #define MX_USART6_CTS_GPIOx      RTE_USART6_CTS_PORT
    #define MX_USART6_CTS_GPIO_Pin   (1U << RTE_USART6_CTS_BIT)
    #define MX_USART6_CTS_GPIO_PuPd  GPIO_NOPULL
    #define MX_USART6_CTS_GPIO_Speed USART6_GPIO_SPEED_FREQ
    #define MX_USART6_CTS_GPIO_AF    GPIO_AF8_USART6
  #endif
#endif

