Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.h
// UART7 configuration definitions
#if (RTE_UART7 == 1)

  #ifndef UART7
    #error "UART7 not available for selected device!"
  #endif

  #define MX_UART7

  #if (RTE_UART7_RX_DMA == 1)
    #define MX_UART7_RX_DMA_Instance DMAx_STREAMy(RTE_UART7_RX_DMA_NUMBER, RTE_UART7_RX_DMA_STREAM)
    #define MX_UART7_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_UART7_RX_DMA_NUMBER, RTE_UART7_RX_DMA_STREAM)
    #define MX_UART7_RX_DMA_Channel  DMA_CHANNEL_x(RTE_UART7_RX_DMA_CHANNEL)
    #define MX_UART7_RX_DMA_Priority DMA_PRIORITY(RTE_UART7_RX_DMA_PRIORITY)

    #define UART7_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_UART7_RX_DMA_NUMBER, RTE_UART7_RX_DMA_STREAM)
  #endif
  #if (RTE_UART7_TX_DMA == 1)
    #define MX_UART7_TX_DMA_Instance DMAx_STREAMy(RTE_UART7_TX_DMA_NUMBER, RTE_UART7_TX_DMA_STREAM)
    #define MX_UART7_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_UART7_TX_DMA_NUMBER, RTE_UART7_TX_DMA_STREAM)
    #define MX_UART7_TX_DMA_Channel  DMA_CHANNEL_x(RTE_UART7_TX_DMA_CHANNEL)
    #define MX_UART7_TX_DMA_Priority DMA_PRIORITY(RTE_UART7_TX_DMA_PRIORITY)

    #define UART7_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_UART7_TX_DMA_NUMBER, RTE_UART7_TX_DMA_STREAM)
  #endif

  #ifndef UART7_GPIO_SPEED_FREQ
    #define UART7_GPIO_SPEED_FREQ    GPIO_SPEED_FREQ_LOW
  #endif

  #if (RTE_UART7_TX == 1)
    #if !defined (STM32F413xx) && !defined (STM32F423xx)
      // UART7 TX available on pins: PF7, PE8
      #if ((RTE_UART7_TX_ID == 3) || (RTE_UART7_TX_ID == 3))
        #error "PA15, PB4 can not be configured as UART7 TX on selected device!"
      #endif
    #endif

    #define MX_UART7_TX_Pin        1
    #define MX_UART7_TX_GPIOx      RTE_UART7_TX_PORT
    #define MX_UART7_TX_GPIO_Pin   (1U << RTE_UART7_TX_BIT)
    #define MX_UART7_TX_GPIO_PuPd  GPIO_NOPULL
    #define MX_UART7_TX_GPIO_Speed UART7_GPIO_SPEED_FREQ
    #define MX_UART7_TX_GPIO_AF    GPIO_AF8_UART7
  #endif

  #if (RTE_UART7_RX == 1)
    #if !defined (STM32F413xx) && !defined (STM32F423xx)
      // UART7 RX available on pins: PF6, PE7
      #if ((RTE_UART7_RX_ID == 3) || (RTE_UART7_RX_ID == 3))
        #error "PA8, PB3 can not be configured as UART7 RX on selected device!"
      #endif
    #endif

    #define MX_UART7_RX_Pin        1
    #define MX_UART7_RX_GPIOx      RTE_UART7_RX_PORT
    #define MX_UART7_RX_GPIO_Pin   (1U << RTE_UART7_RX_BIT)
    #define MX_UART7_RX_GPIO_PuPd  GPIO_NOPULL
    #define MX_UART7_RX_GPIO_Speed UART7_GPIO_SPEED_FREQ
    #define MX_UART7_RX_GPIO_AF   GPIO_AF8_UART7
  #endif
#endif

// UART8 configuration definitions
#if (RTE_UART8 == 1)

  #ifndef UART8
    #error "UART8 not available for selected device!"
  #endif

  #define MX_UART8

  #if (RTE_UART8_RX_DMA == 1)
    #define MX_UART8_RX_DMA_Instance DMAx_STREAMy(RTE_UART8_RX_DMA_NUMBER, RTE_UART8_RX_DMA_STREAM)
    #define MX_UART8_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_UART8_RX_DMA_NUMBER, RTE_UART8_RX_DMA_STREAM)
    #define MX_UART8_RX_DMA_Channel  DMA_CHANNEL_x(RTE_UART8_RX_DMA_CHANNEL)
    #define MX_UART8_RX_DMA_Priority DMA_PRIORITY(RTE_UART8_RX_DMA_PRIORITY)

    #define UART8_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_UART8_RX_DMA_NUMBER, RTE_UART8_RX_DMA_STREAM)
  #endif
  #if (RTE_UART8_TX_DMA == 1)
    #define MX_UART8_TX_DMA_Instance DMAx_STREAMy(RTE_UART8_TX_DMA_NUMBER, RTE_UART8_TX_DMA_STREAM)
    #define MX_UART8_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_UART8_TX_DMA_NUMBER, RTE_UART8_TX_DMA_STREAM)
    #define MX_UART8_TX_DMA_Channel  DMA_CHANNEL_x(RTE_UART8_TX_DMA_CHANNEL)
    #define MX_UART8_TX_DMA_Priority DMA_PRIORITY(RTE_UART8_TX_DMA_PRIORITY)

    #define UART8_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_UART8_TX_DMA_NUMBER, RTE_UART8_TX_DMA_STREAM)
  #endif

  #ifndef UART8_GPIO_SPEED_FREQ
    #define UART8_GPIO_SPEED_FREQ    GPIO_SPEED_FREQ_LOW
  #endif

  #if (RTE_UART8_TX == 1)
    #if !defined (STM32F413xx) && !defined (STM32F423xx)
      // UART8 TX available on pins: PE1
      #if ((RTE_UART8_TX_ID == 2))
        #error "PF9 can not be configured as UART8 TX on selected device!"
      #endif
    #endif

    #define MX_UART8_TX_Pin        1
    #define MX_UART8_TX_GPIOx      RTE_UART8_TX_PORT
    #define MX_UART8_TX_GPIO_Pin   (1U << RTE_UART8_TX_BIT)
    #define MX_UART8_TX_GPIO_PuPd  GPIO_NOPULL
    #define MX_UART8_TX_GPIO_Speed UART8_GPIO_SPEED_FREQ
    #define MX_UART8_TX_GPIO_AF   GPIO_AF8_UART8
  #endif

  #if (RTE_UART8_RX == 1)
    #if !defined (STM32F413xx) && !defined (STM32F423xx)
      // UART8 RX available on pins: PE0
      #if ((RTE_UART8_RX_ID == 2))
        #error "PF8 can not be configured as UART8 RX on selected device!"
      #endif
    #endif

    #define MX_UART8_RX_Pin        1
    #define MX_UART8_RX_GPIOx      RTE_UART8_RX_PORT
    #define MX_UART8_RX_GPIO_Pin   (1U << RTE_UART8_RX_BIT)
    #define MX_UART8_RX_GPIO_PuPd  GPIO_NOPULL
    #define MX_UART8_RX_GPIO_Speed UART8_GPIO_SPEED_FREQ
    #define MX_UART8_RX_GPIO_AF    GPIO_AF8_UART8
  #endif
#endif

// UART9 configuration definitions
#if (!defined (STM32F413xx) && !defined (STM32F423xx)) && defined (USART9)
  // USART9 not available
  #undef USART9
#endif

#if (RTE_UART9 == 1)

  #ifndef UART9
    #error "UART9 not available for selected device!"
  #endif

  #define MX_UART9

  #if (RTE_UART9_RX_DMA == 1)
    #define MX_UART9_RX_DMA_Instance DMAx_STREAMy(RTE_UART9_RX_DMA_NUMBER, RTE_UART9_RX_DMA_STREAM)
    #define MX_UART9_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_UART9_RX_DMA_NUMBER, RTE_UART9_RX_DMA_STREAM)
    #define MX_UART9_RX_DMA_Channel  DMA_CHANNEL_x(RTE_UART9_RX_DMA_CHANNEL)
    #define MX_UART9_RX_DMA_Priority DMA_PRIORITY(RTE_UART9_RX_DMA_PRIORITY)

    #define UART9_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_UART9_RX_DMA_NUMBER, RTE_UART9_RX_DMA_STREAM)
  #endif
  #if (RTE_UART9_TX_DMA == 1)
    #define MX_UART9_TX_DMA_Instance DMAx_STREAMy(RTE_UART9_TX_DMA_NUMBER, RTE_UART9_TX_DMA_STREAM)
    #define MX_UART9_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_UART9_TX_DMA_NUMBER, RTE_UART9_TX_DMA_STREAM)
    #define MX_UART9_TX_DMA_Channel  DMA_CHANNEL_x(RTE_UART9_TX_DMA_CHANNEL)
    #define MX_UART9_TX_DMA_Priority DMA_PRIORITY(RTE_UART9_TX_DMA_PRIORITY)

