Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.h
    #define UART9_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_UART9_TX_DMA_NUMBER, RTE_UART9_TX_DMA_STREAM)
  #endif

  #ifndef UART9_GPIO_SPEED_FREQ
    #define UART9_GPIO_SPEED_FREQ    GPIO_SPEED_FREQ_LOW
  #endif

  #if (RTE_UART9_TX == 1)
    #define MX_UART9_TX_Pin        1
    #define MX_UART9_TX_GPIOx      RTE_UART9_TX_PORT
    #define MX_UART9_TX_GPIO_Pin   (1U << RTE_UART9_TX_BIT)
    #define MX_UART9_TX_GPIO_PuPd  GPIO_NOPULL
    #define MX_UART9_TX_GPIO_Speed UART9_GPIO_SPEED_FREQ
    #define MX_UART9_TX_GPIO_AF    GPIO_AF11_UART9
  #endif

  #if (RTE_UART9_RX == 1)
    #define MX_UART9_RX_Pin        1
    #define MX_UART9_RX_GPIOx      RTE_UART9_RX_PORT
    #define MX_UART9_RX_GPIO_Pin   (1U << RTE_UART9_RX_BIT)
    #define MX_UART9_RX_GPIO_PuPd  GPIO_NOPULL
    #define MX_UART9_RX_GPIO_Speed UART9_GPIO_SPEED_FREQ
    #define MX_UART9_RX_GPIO_AF    GPIO_AF11_UART9
  #endif
#endif

// UART10 configuration definitions
#if (!defined (STM32F413xx) && !defined (STM32F423xx)) && defined (USART10)
  // USART10 not available
  #undef USART10
#endif

#if (RTE_UART10 == 1)

  #ifndef UART10
    #error "UART10 not available for selected device!"
  #endif

  #define MX_UART10

  #if (RTE_UART10_RX_DMA == 1)
    #define MX_UART10_RX_DMA_Instance DMAx_STREAMy(RTE_UART10_RX_DMA_NUMBER, RTE_UART10_RX_DMA_STREAM)
    #define MX_UART10_RX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_UART10_RX_DMA_NUMBER, RTE_UART10_RX_DMA_STREAM)
    #define MX_UART10_RX_DMA_Channel  DMA_CHANNEL_x(RTE_UART10_RX_DMA_CHANNEL)
    #define MX_UART10_RX_DMA_Priority DMA_PRIORITY(RTE_UART10_RX_DMA_PRIORITY)

    #define UART10_RX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_UART10_RX_DMA_NUMBER, RTE_UART10_RX_DMA_STREAM)
  #endif
  #if (RTE_UART10_TX_DMA == 1)
    #define MX_UART10_TX_DMA_Instance DMAx_STREAMy(RTE_UART10_TX_DMA_NUMBER, RTE_UART10_TX_DMA_STREAM)
    #define MX_UART10_TX_DMA_IRQn     DMAx_STREAMy_IRQn(RTE_UART10_TX_DMA_NUMBER, RTE_UART10_TX_DMA_STREAM)
    #define MX_UART10_TX_DMA_Channel  DMA_CHANNEL_x(RTE_UART10_TX_DMA_CHANNEL)
    #define MX_UART10_TX_DMA_Priority DMA_PRIORITY(RTE_UART10_TX_DMA_PRIORITY)

    #define UART10_TX_DMA_Handler     DMAx_STREAMy_IRQ(RTE_UART10_TX_DMA_NUMBER, RTE_UART10_TX_DMA_STREAM)
  #endif

  #ifndef UART10_GPIO_SPEED_FREQ
    #define UART10_GPIO_SPEED_FREQ    GPIO_SPEED_FREQ_LOW
  #endif

  #if (RTE_UART10_TX == 1)
    #define MX_UART10_TX_Pin        1
    #define MX_UART10_TX_GPIOx      RTE_UART10_TX_PORT
    #define MX_UART10_TX_GPIO_Pin   (1U << RTE_UART10_TX_BIT)
    #define MX_UART10_TX_GPIO_PuPd  GPIO_NOPULL
    #define MX_UART10_TX_GPIO_Speed UART10_GPIO_SPEED_FREQ
    #define MX_UART10_TX_GPIO_AF    GPIO_AF11_UART10
  #endif

  #if (RTE_UART10_RX == 1)
    #define MX_UART10_RX_Pin        1
    #define MX_UART10_RX_GPIOx      RTE_UART10_RX_PORT
    #define MX_UART10_RX_GPIO_Pin   (1U << RTE_UART10_RX_BIT)
    #define MX_UART10_RX_GPIO_PuPd  GPIO_NOPULL
    #define MX_UART10_RX_GPIO_Speed UART10_GPIO_SPEED_FREQ
    #define MX_UART10_RX_GPIO_AF    GPIO_AF11_UART10
  #endif
#endif

#endif /* RTE_DEVICE_FRAMEWORK_CLASSIC */

#if defined(RTE_DEVICE_FRAMEWORK_CUBE_MX)
  #if ((defined(RTE_Drivers_USART1) || \
        defined(RTE_Drivers_USART2) || \
        defined(RTE_Drivers_USART3) || \
        defined(RTE_Drivers_UART4 ) || \
        defined(RTE_Drivers_UART5 ) || \
        defined(RTE_Drivers_USART6) || \
        defined(RTE_Drivers_UART7 ) || \
        defined(RTE_Drivers_UART8 ) || \
        defined(RTE_Drivers_UART9 ) || \
        defined(RTE_Drivers_UART10))   \
        && (!defined (MX_USART1))      \
        && (!defined (MX_USART2))      \
        && (!defined (MX_USART3))      \
        && (!defined (MX_UART4 ))      \
        && (!defined (MX_UART5 ))      \
        && (!defined (MX_USART6))      \
        && (!defined (MX_UART7 ))      \
        && (!defined (MX_UART8 ))      \
        && (!defined (MX_UART9 ))      \
        && (!defined (MX_UART10)))
    #error "USART not configured in STM32CubeMX!"
  #endif

#ifdef USART6
  #ifndef RCC_APB2RSTR_USART6RST
    #define  RCC_APB2RSTR_USART6RST ((uint32_t)0x00000020)
  #endif
#endif

// MX macros
#ifdef MX_USART1

#if (MX_USART1_VM == VM_ASYNC)
#ifndef USART_ASYNC
#define USART_ASYNC                      (1UL)
#endif
#elif (MX_USART1_VM == VM_SYNC)
#ifndef USART_SYNC
#define USART_SYNC                       (1UL)
#endif
#elif (MX_USART1_VM == VM_IRDA)
#ifndef USART_IRDA
#define USART_IRDA                       (1UL)
#endif
#elif (MX_USART1_VM == VM_SMARTCARD)
#ifndef USART_SMARTCARD
#define USART_SMARTCARD                  (1UL)
#endif
#endif
#endif


#ifdef MX_USART2

#if (MX_USART2_VM == VM_ASYNC)
#ifndef USART_ASYNC
#define USART_ASYNC                      (1UL)
#endif
#elif (MX_USART2_VM == VM_SYNC)
#ifndef USART_SYNC
#define USART_SYNC                       (1UL)
#endif
#elif (MX_USART2_VM == VM_IRDA)
#ifndef USART_IRDA
#define USART_IRDA                       (1UL)
#endif
#elif (MX_USART2_VM == VM_SMARTCARD)
#ifndef USART_SMARTCARD
#define USART_SMARTCARD                  (1UL)
#endif
#endif
#endif


#ifdef MX_USART3

#if (MX_USART3_VM == VM_ASYNC)
#ifndef USART_ASYNC
#define USART_ASYNC                      (1UL)
#endif
#elif (MX_USART3_VM == VM_SYNC)
#ifndef USART_SYNC
#define USART_SYNC                       (1UL)
#endif
#elif (MX_USART3_VM == VM_IRDA)
#ifndef USART_IRDA
#define USART_IRDA                       (1UL)
#endif
#elif (MX_USART3_VM == VM_SMARTCARD)
#ifndef USART_SMARTCARD
#define USART_SMARTCARD                  (1UL)
#endif
#endif
#endif


#ifdef MX_UART4

#if (MX_UART4_VM == VM_ASYNC)
#ifndef USART_ASYNC
#define USART_ASYNC                      (1UL)
#endif
#elif (MX_UART4_VM == VM_IRDA)
#ifndef USART_IRDA
#define USART_IRDA                       (1UL)
#endif
#endif
#endif


#ifdef MX_UART5

#if (MX_UART5_VM == VM_ASYNC)
#ifndef USART_ASYNC
#define USART_ASYNC                      (1UL)
#endif
#elif (MX_UART5_VM == VM_IRDA)
#ifndef USART_IRDA
#define USART_IRDA                       (1UL)
#endif
#endif
#endif


#ifdef MX_USART6

#if (MX_USART6_VM == VM_ASYNC)
#ifndef USART_ASYNC
#define USART_ASYNC                      (1UL)
#endif
#elif (MX_USART6_VM == VM_SYNC)
#ifndef USART_SYNC
#define USART_SYNC                       (1UL)
#endif
#elif (MX_USART6_VM == VM_IRDA)
#ifndef USART_IRDA
#define USART_IRDA                       (1UL)
#endif
#elif (MX_USART6_VM == VM_SMARTCARD)
#ifndef USART_SMARTCARD
#define USART_SMARTCARD                  (1UL)
#endif
#endif
#endif


#ifdef MX_UART7

