Jason-xy/WuhuTakeOff/SDK/V4_FreeRTOS-F411/.pack/Keil/STM32F4xx_DFP.2.15.0/CMSIS/Driver/USART_STM32F4xx.h
// USART synchronous xfer modes
#define USART_SYNC_MODE_TX           ( 1UL )
#define USART_SYNC_MODE_RX           ( 2UL )
#define USART_SYNC_MODE_TX_RX        (USART_SYNC_MODE_TX | \
                                      USART_SYNC_MODE_RX)

// DMA Callback functions
typedef void (*DMA_Callback_t) (DMA_HandleTypeDef *hdma);

// USART DMA
typedef const struct _USART_DMA {
  DMA_HandleTypeDef    *hdma;           // DMA handle
  DMA_Callback_t        cb_complete;    // DMA complete callback
#ifdef RTE_DEVICE_FRAMEWORK_CLASSIC
  DMA_Stream_TypeDef   *stream;         // Stream register interface
  uint32_t              channel;        // DMA channel
  uint32_t              priority;       // DMA channel priority
  IRQn_Type             irq_num;        // Stream IRQ number
  uint8_t               reserved[3];    // Reserved
#endif
} USART_DMA;

// USART pin
typedef const struct _USART_PIN {
  GPIO_TypeDef         *port;           // Port
  uint16_t              pin;            // Pin
  uint16_t              af;             // Alternate function
  uint16_t              pupd;           // Pull up/down
  uint16_t              speed;          // Speed
} USART_PIN;

// USART Input/Output Configuration
typedef const struct _USART_IO {
  USART_PIN            *tx;             // TX  Pin identifier
  USART_PIN            *rx;             // RX  Pin identifier
  USART_PIN            *ck;             // CLK Pin identifier
  USART_PIN            *rts;            // RTS Pin identifier
  USART_PIN            *cts;            // CTS Pin identifier
} USART_IO;

// USART Transfer Information (Run-Time)
typedef struct _USART_TRANSFER_INFO {
  uint32_t              rx_num;         // Total number of receive data
  uint32_t              tx_num;         // Total number of transmit data
  uint8_t              *rx_buf;         // Pointer to in data buffer
  uint8_t              *tx_buf;         // Pointer to out data buffer
  uint32_t              rx_cnt;         // Number of data received
  uint32_t              tx_cnt;         // Number of data sent
  uint16_t              dump_val;       // Variable for dumping DMA data
  uint16_t              def_val;        // Default transfer value
  uint32_t              sync_mode;      // Synchronous mode flag
  uint8_t               break_flag;     // Transmit break flag
  uint8_t               send_active;    // Send active flag
  uint16_t              reserved;       // Reserved
} USART_TRANSFER_INFO;

typedef struct _USART_STATUS {
  uint8_t tx_busy;                      // Transmitter busy flag
  uint8_t rx_busy;                      // Receiver busy flag
  uint8_t tx_underflow;                 // Transmit data underflow detected (cleared on start of next send operation)
  uint8_t rx_overflow;                  // Receive data overflow detected (cleared on start of next receive operation)
  uint8_t rx_break;                     // Break detected on receive (cleared on start of next receive operation)
  uint8_t rx_framing_error;             // Framing error detected on receive (cleared on start of next receive operation)
  uint8_t rx_parity_error;              // Parity error detected on receive (cleared on start of next receive operation)
} USART_STATUS;

// USART Information (Run-time)
typedef struct _USART_INFO {
  ARM_USART_SignalEvent_t cb_event;            // Event Callback
  USART_STATUS            status;              // Status flags
  uint8_t                 flags;               // Current USART flags
  uint32_t                mode;                // Current USART mode
  uint32_t                flow_control;        // Flow control
} USART_INFO;

// USART Resources definition
typedef const struct {
#ifdef RTE_DEVICE_FRAMEWORK_CUBE_MX
  void                   *h;                   // USART Handle
  uint32_t                vmode;               // Virtual mode
#endif
  ARM_USART_CAPABILITIES  capabilities;        // Capabilities
  USART_TypeDef          *reg;                 // USART peripheral pointer
  uint32_t              (*periph_clock)(void); // Peripheral bus clock
  USART_IO                io;                  // USART Input/Output pins
  IRQn_Type               irq_num;             // USART IRQ Number
  uint8_t                 reserved[3];         // Reserved
  USART_DMA               *dma_tx;             // Transmit stream register interface
  USART_DMA               *dma_rx;             // Receive stream register interface
  USART_INFO              *info;               // Run-Time Information
  USART_TRANSFER_INFO     *xfer;               // USART transfer information
} USART_RESOURCES;

// Global functions and variables exported by driver .c module
#ifdef MX_USART1
extern void USART1_IRQHandler     (void);
extern void USART1_TX_DMA_Handler (void);
extern void USART1_RX_DMA_Handler (void);

extern ARM_DRIVER_USART Driver_USART1;
#endif

#ifdef MX_USART2
extern void USART2_IRQHandler     (void);
extern void USART2_TX_DMA_Handler (void);
extern void USART2_RX_DMA_Handler (void);

extern ARM_DRIVER_USART Driver_USART2;
#endif

#ifdef MX_USART3
extern void USART3_IRQHandler     (void);
extern void USART3_TX_DMA_Handler (void);
extern void USART3_RX_DMA_Handler (void);

extern ARM_DRIVER_USART Driver_USART3;
#endif

#ifdef MX_UART4
extern void UART4_IRQHandler      (void);
extern void UART4_TX_DMA_Handler  (void);
extern void UART4_RX_DMA_Handler  (void);

extern ARM_DRIVER_USART Driver_USART4;
#endif

#ifdef MX_UART5
extern void UART5_IRQHandler      (void);
extern void UART5_TX_DMA_Handler  (void);
extern void UART5_RX_DMA_Handler  (void);

extern ARM_DRIVER_USART Driver_USART5;
#endif

#ifdef MX_USART6
extern void USART6_IRQHandler     (void);
extern void USART6_TX_DMA_Handler (void);
extern void USART6_RX_DMA_Handler (void);

extern ARM_DRIVER_USART Driver_USART6;
#endif

#ifdef MX_UART7
extern void UART7_IRQHandler      (void);
extern void UART7_TX_DMA_Handler  (void);
extern void UART7_RX_DMA_Handler  (void);

extern ARM_DRIVER_USART Driver_USART7;
#endif

#ifdef MX_UART8
extern void UART8_IRQHandler      (void);
extern void UART8_TX_DMA_Handler  (void);
extern void UART8_RX_DMA_Handler  (void);

extern ARM_DRIVER_USART Driver_USART8;
#endif

#ifdef MX_UART9
extern void UART9_IRQHandler      (void);
extern void UART9_TX_DMA_Handler  (void);
extern void UART9_RX_DMA_Handler  (void);

extern ARM_DRIVER_USART Driver_USART9;
#endif

#ifdef MX_UART10
extern void UART10_IRQHandler      (void);
extern void UART10_TX_DMA_Handler  (void);
extern void UART10_RX_DMA_Handler  (void);

extern ARM_DRIVER_USART Driver_USART10;
#endif

#endif /* __USART_STM32F4XX_H */
